Repository: ahmedHamdyyyy/Graduation-project-Social-News
Catalog: lib/l10n/app_*.arb
Languages: ar

source: local storage connection error.
ar: .خطا بالاتصال بالذاكرة الداخلية

# networkConnectionError
source: Network connection error check the internet connection.
ar: لا يوجد اتصال بالانترنت.

# server400Error
source: Server error 400 (Bad Request).
ar: خطا في الاتصال بالسيرفر (400)

# server404Error
source: Server error 404 (server not found).
ar: خطا في الاتصال بالسيرفر (404)

# server401Error
source: Server error 401 (Authentication credential).
ar: خطا في الاتصال بالسيرفر (401)

# server403Error
source: Server error 403 (have no permission).
ar: خطا في الاتصال بالسيرفر (403)

# server500Error
source: Server error 500 (Internal Server Error).
ar: خطا في الاتصال بالسيرفر (500)

# unKnownError
source: unKnown error please try again later.
ar: خطا غير متوقع

# userError
source: Bad Usage Of The App.
ar: استخدام خاطئ للتطبيق

# phoneUsedBefore
source: this phone number is currently used
ar: رقم الهاتف مستخدم بالفعل

# emailUsedBefore
source: this email is currently used
ar: البريد الالكتروني مستخدم بالفعل

source: profile setting
ar: اعداد الملف الشخصي

source: about
ar: عن التطبيق

source: theme
ar: شكل التطبيق

source: language
ar: اللغة

source: logout
ar: تسجيل خروج

source: search
ar: بحث

source: user
ar: مستخدم

source: content
ar: محتوي

source: confirm
ar: تاكيد

source: cancel
ar: الغاء
